In [2]:
import pandas as pd

In [4]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
s2 = pd.Series([80,90,85,76],index = ["EMMA","EDUBE","GULOBA","JOY"])
s2

EMMA      80
EDUBE     90
GULOBA    85
JOY       76
dtype: int64

In [7]:
d = {"EMMA":92,"EDUBE":82,"GULOBA":84,"ANITA":85}

In [9]:
s4 = pd.Series(d)
s4

EMMA      92
EDUBE     82
GULOBA    84
ANITA     85
dtype: int64

In [11]:
students_list = [['EDUBE','EDUBE',21,'DATA SCIENCE',90],
                   ['OSCAR','ODOKARA',24,'NETWORKING',92],
                   ['JOY','AWORI',20,'ANALYTICS',89],
                   ['BENJA','MUTUMBA',22,'DATABASE',90]]

In [12]:
df1 = pd.DataFrame(students_list)

In [13]:
df1

       0        1   2             3   4
0  EDUBE    EDUBE  21  DATA SCIENCE  90
1  OSCAR  ODOKARA  24    NETWORKING  92
2    JOY    AWORI  20     ANALYTICS  89
3  BENJA  MUTUMBA  22      DATABASE  90

In [14]:
df1 = pd.DataFrame(students_list,columns=['FNAME','LNAME','AGE','MAJOR','SCORE'])

In [15]:
df1

   FNAME    LNAME  AGE         MAJOR  SCORE
0  EDUBE    EDUBE   21  DATA SCIENCE     90
1  OSCAR  ODOKARA   24    NETWORKING     92
2    JOY    AWORI   20     ANALYTICS     89
3  BENJA  MUTUMBA   22      DATABASE     90

In [16]:
df1 = pd.DataFrame(students_list,columns=['FNAME','LNAME','AGE','MAJOR','SCORE'],index=['ema2gmail.com','oscar@gmail.com','joy@gmail.com','benja@gmail.com'])

In [17]:
df1

                 FNAME    LNAME  AGE         MAJOR  SCORE
ema2gmail.com    EDUBE    EDUBE   21  DATA SCIENCE     90
oscar@gmail.com  OSCAR  ODOKARA   24    NETWORKING     92
joy@gmail.com      JOY    AWORI   20     ANALYTICS     89
benja@gmail.com  BENJA  MUTUMBA   22      DATABASE     90

In [18]:
student_dict = {'FNAME':['EDUBE','OSCAR','JOY','BENJA'],
                'LNAME':['EDUBE','ODOKARA','AWORI','MUTUMBA'],
                'AGE':[20,23,21,21],
                'MAJOR':['DATA SCIENCE','COMPUTER','ANALYTICS','DATABASE'],
                'SCORE':[90,92,89,90]}

In [19]:
df2 = pd.DataFrame(student_dict)

In [20]:
df2

   FNAME    LNAME  AGE         MAJOR  SCORE
0  EDUBE    EDUBE   20  DATA SCIENCE     90
1  OSCAR  ODOKARA   23      COMPUTER     92
2    JOY    AWORI   21     ANALYTICS     89
3  BENJA  MUTUMBA   21      DATABASE     90

In [21]:
df1

                 FNAME    LNAME  AGE         MAJOR  SCORE
ema2gmail.com    EDUBE    EDUBE   21  DATA SCIENCE     90
oscar@gmail.com  OSCAR  ODOKARA   24    NETWORKING     92
joy@gmail.com      JOY    AWORI   20     ANALYTICS     89
benja@gmail.com  BENJA  MUTUMBA   22      DATABASE     90

In [22]:
df1.columns

Index(['FNAME', 'LNAME', 'AGE', 'MAJOR', 'SCORE'], dtype='object')

In [23]:
df1.index

Index(['ema2gmail.com', 'oscar@gmail.com', 'joy@gmail.com', 'benja@gmail.com'], dtype='object')

In [24]:
df1.shape

(4, 5)

In [25]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, ema2gmail.com to benja@gmail.com
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   FNAME   4 non-null      object
 1   LNAME   4 non-null      object
 2   AGE     4 non-null      int64
 3   MAJOR   4 non-null      object
 4   SCORE   4 non-null      int64
dtypes: int64(2), object(3)
memory usage: 192.0+ bytes

In [27]:
df1.describe()

             AGE      SCORE
count   4.000000   4.000000
mean   21.750000  90.250000
std     1.707825   1.258306
min    20.000000  89.000000
25%    20.750000  89.750000
50%    21.500000  90.000000
75%    22.500000  90.500000
max    24.000000  92.000000

In [28]:
df1.tail(1)

                 FNAME    LNAME  AGE     MAJOR  SCORE
benja@gmail.com  BENJA  MUTUMBA   22  DATABASE     90

In [29]:
df1.head(1)

               FNAME  LNAME  AGE         MAJOR  SCORE
ema2gmail.com  EDUBE  EDUBE   21  DATA SCIENCE     90